20220215180244-democracy_takes_precedence.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-01 Mon 17:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Democracy takes precedence</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Democracy takes precedence</h1>
<dl class="org-dl">
<dt>tags</dt><dd><a href="20220306175155-democracy.html#ID-bf925a86-18be-4845-ad88-063a28f359f4">Democracy</a></dd>
</dl>

<p>
Democracy takes precedence over many concepts. By that I mean that one does not need anything but democracy as an ideal to justify these concepts. <a href="20220215180519-progressive_taxes_are_justified_by_the_need_to_preserve_democracy.html#ID-41209f8c-5f1e-43e5-83bc-742c25e4d97c">Progressive taxes are justified by the need to preserve democracy</a>, for instance: if you don't enforce progressive taxation you risk corruption and people accumulating power that is in competition with people's right to vote. <a href="20220215180859-states_raising_funds_on_financial_markets_is_a_threat_to_democracy.html#ID-88128fec-69c4-4e2d-92ec-303e448cc56c">States raising funds on financial markets is also a threat to democracy</a>: while market pundits will argue markets are democratic, in practice you are signing yourself up for oligarchy: 50% of the US' sovereign debt is owned by 1% of the population. And people who loan money to the State are more likely to be heard than others.
</p>

<div id="outline-container-org1dc4211" class="outline-2">
<h2 id="org1dc4211">Links to this note</h2>
<div class="outline-text-2" id="text-org1dc4211">
<ul class="org-ul">
<li><a href="./20220306175155-democracy.html">Democracy</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
